Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper


Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.Instance


Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.Functionality


Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.#ctor(Tekla.Structures.TeklaStructuresInternal.ICDelegate,Tekla.Structures.Internal.WrapperFunctionalityBase)
Instance:
Functionality:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetCurrentProgramVersion(Tekla.Structures.Internal.dotProgramVersion_t@)
pProgramVersion:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetCurrentUser(System.String@)
user:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetToolOptionValue(System.String@)
toolOptionName:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetSetClashCheckOptions(Tekla.Structures.Internal.dotClashCheckOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetSetComponentOptions(Tekla.Structures.Internal.dotComponentOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportTestingFeaturesHandler(Tekla.Structures.TeklaStructuresInternal.dotTestingFeaturesHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportFeatureSupportHandler(Tekla.Structures.TeklaStructuresInternal.dotFeatureSupportHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetModuleQuery(Tekla.Structures.Internal.dotModuleManagerQuery_t@)
pModuleQuery:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetAnalysisModuleQuery(Tekla.Structures.Internal.DotAnalysisModuleManagerQuery@)
pModuleQuery:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetIdentifierByGUID(Tekla.Structures.Internal.dotIdentifierToGUID_t@)
DO NOT USE! For internal usage only!
pIdentifierToGUID:
Returns:

Tekla.Structures.TeklaStructuresInternal.CDelegateWrapper.ExportGetAttributeFile(Tekla.Structures.TeklaStructuresInternal.dotGetAttributeFile_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: True if file was found.